code-review/NRB_3471_3546/База_Было/Documents/СводныйОтчетОСовершенныхОперациях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СводныйОтчетОСовершенныхОперациях</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправкиОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПередачиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЦБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеОтчетаВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеНКД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАнкетныхДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБПолное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБЧастичное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеРеестраВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УчастиеВКД</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОперации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
								<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
								<v8:Type>cfg:DocumentRef.ИзменениеАнкетныхДанных</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
								<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
								<v8:Type>cfg:DocumentRef.УчастиеВКД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеОперации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
								<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнициаторОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦБ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеВыпуска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегНом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСчетовДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРазделаСчетаДепо</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыРазделовСчетовДЕПО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусНомерОтменяемого</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЦБ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотЗачислено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОборотСписано</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаФиксации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерВыплатыНа1ЦБ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РазмерВыплатыНа1ЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяСуммаНачисленной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалогаУдержанного</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеУдержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКВыплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентД1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентД2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходПеречисленНа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СтатусыПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПоручений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказаноВИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполненоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеНалога</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/СводныйОтчетОСовершенныхОперациях/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Формирует печатную форму для СводныйОтчетОСовершенныхОперациях.
//
// Параметры:
//  ДокументОСовершенныхОперациях				 - ДокументСсылка	 - Документ для печати
//  ОперацииДокумента							 - ТаблицаЗначений	 - Таблица операций документа
//  ВыводитьФаксимилеВОтчетах					 - Булево			 - Признак вывода факсимиле в печатную форму
//  УникальныйИдентификатор						 - УникальныйИдентификатор	 - УИД документа
// 
// Возвращаемое значение:
//   - Структура -
//  Ошибка, если не удалось сформировать печатную форму
//  Заголовок - заголовок печатной формы
//  Адрес  - адрес печатной формы во временном хранилище формы с УникальныйИдентификатор
//
Функция АдресПечатнойФормы(
	ДокументОСовершенныхОперациях,
	Знач ОперацииДокумента,
	ВыводитьФаксимилеВОтчетах,
	УникальныйИдентификатор) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОСовершенныхОперациях) Тогда
		Описатель = Новый Структура;
		Описатель.Вставить("Ошибка", "Не указан документ ДокументСводныйОтчетОСовершенныхОперациях.");
		Возврат ПоместитьВоВременноеХранилище(Описатель, УникальныйИдентификатор);
	Иначе
		Если Не ЗначениеЗаполнено(ОперацииДокумента) Тогда
			Попытка
				ОперацииДокумента = ДокументОСовершенныхОперациях.Операции.Выгрузить();
			Исключение
				ОперацииДокумента = Неопределено;
			КонецПопытки;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОперацииДокумента) Тогда
			Описатель = Новый Структура;
			Описатель.Вставить("Ошибка", "Нет операций для документа " + ДокументОСовершенныхОперациях);
			Возврат ПоместитьВоВременноеХранилище(Описатель, УникальныйИдентификатор);
		КонецЕсли;
		
		Возврат АдресПечатнойФормыОперации(
			ДокументОСовершенныхОперациях,
			ОперацииДокумента,
			ВыводитьФаксимилеВОтчетах,
			УникальныйИдентификатор);
			
	КонецЕсли;
	
КонецФункции

// Процедура - Исполнить поручение выпиской
//
// Параметры:
//  ДокументОперации					 - ДокументСсылка	 - Документ, на основании которого исполняется поручение
//  ИсключитьИзменениеВремениИсполнения	 - Булево			 - Исключить исполнение поручение из-за изменении времени документа
//  ЭтоВстречноеИсполнение				 - Булево			 - Это встречное исполнение для поручения с видом Перевод
//
Процедура ИсполнитьПоручениеВыпиской(ДокументОперации, ИсключитьИзменениеВремениИсполнения = Ложь, ЭтоВстречноеИсполнение = Ложь) Экспорт
	
	ДокументОснование = ДокументОснованиеИсполнения(ДокументОперации, ЭтоВстречноеИсполнение);
	Если ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.Поручение") Тогда
		Возврат;
	КонецЕсли;
	
	ДатаОперации = ДокументОперации.Дата;
	
	Если Документы.Поручение.ЭтоВыплатаДоходаПоПрогрессивнойШкалеНДФЛ(ДокументОснование) Тогда
		ДатаИсполненияПоручения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДатаИсполненияПоручения");
		Если Не ЗначениеЗаполнено(ДатаИсполненияПоручения) Тогда
			НоваяДатаИсполнения = Документы.Поручение.ДатаИсполненияПорученияВыплатыДоходаПоПрогрессивнойШкалеНДФЛ(ДокументОснование);
			Если ЗначениеЗаполнено(НоваяДатаИсполнения) Тогда
				ДокументПоручение = ДокументОснование.ПолучитьОбъект();
				ДокументПоручение.ДатаИсполненияПоручения = НоваяДатаИсполнения;
				РегистрыСведений.СтатусыПоручений.УстановитьСтатус(ДокументПоручение.Движения, ДокументОснование,
				НоваяДатаИсполнения, Перечисления.СтатусыПоручений.Исполнено);
				ДокументПоручение.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Не СуществуетИсполнениеПоручения(ДокументОснование)
		И ЗначениеЗаполнено(ДокументОснование)
		И ОбщегоНазначения.ЕстьРеквизитДокумента("ДатаИсполненияПоручения", ДокументОснование.Метаданные())
		И ДокументОснование.ДатаИсполненияПоручения <> ДатаОперации И Не ИсключитьИзменениеВремениИсполнения Тогда
		
		ДокументПоручение = ДокументОснование.ПолучитьОбъект();
		ДокументПоручение.ДатаИсполненияПоручения = ДатаОперации;
		ДокументПоручение.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак того, что документ был отправлен ВЭДО
//
// Параметры:
//  ДокументОСовершенныхОперациях				 - ДокументСсылка	 - Проверяемый документ
// 
// Возвращаемое значение:
//   - Булево- Истина, если был отправлен ранее
//
Функция БылОтправленВЭДО(ДокументОСовершенныхОперациях) Экспорт
	
	// Отправка в ЭДО (0) или в Kafka (1)
	ВыгрузкаВЭДО = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("83.СводныеОтчетыВЭДОилиВKafka", 1) = 0;
	
	Запрос = Новый Запрос;
	
	Если ВыгрузкаВЭДО Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РегистрацияДокументовВЭДО.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияДокументовВЭДО
		|ГДЕ
		|	РегистрацияДокументовВЭДО.Документ = &Документ";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЖурналИсходящихСообщенийKafka.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.ЖурналИсходящихСообщенийKafka КАК ЖурналИсходящихСообщенийKafka
		|ГДЕ
		|	ЖурналИсходящихСообщенийKafka.ОтправляемыйОбъект = &Документ
		|	И ЖурналИсходящихСообщенийKafka.Отправлено
		|	И НЕ ЖурналИсходящихСообщенийKafka.ОшибкаОтправки";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Документ", ДокументОСовершенныхОперациях.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АдресПечатнойФормыОперации(
	ДокументОСовершенныхОперациях,
	ОперацииДокумента,
	ВыводитьФаксимилеВОтчетах,
	УникальныйИдентификатор)
	
	ФормированиеОтчетовОСовершенныхОперациях = Обработки.ФормированиеОтчетовОСовершенныхОперациях.Создать();
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Период"					, ОперацииДокумента[0].ДатаОперации);
	ПараметрыПечати.Вставить("ДатаОтчета"				, ДокументОСовершенныхОперациях.Дата);
	ПараметрыПечати.Вставить("СчетДепо"					, ДокументОСовершенныхОперациях.СчетДепо);
	ПараметрыПечати.Вставить("ДокументОснование"		, ДокументОСовершенныхОперациях);
	ПараметрыПечати.Вставить("Клиент"					, ДокументОСовершенныхОперациях.СчетДепо.Владелец);
	ПараметрыПечати.Вставить("ОтчетыНаАнглийскомЯзыке"	, ДокументОСовершенныхОперациях.СчетДепо.Владелец.ОтчетыНаАнглийскомЯзыке);
	ПараметрыПечати.Вставить("ТаблицаОпераций"			, ОперацииДокумента);
	ПараметрыПечати.Вставить("ВыводитьФаксимилеВОтчетах", ВыводитьФаксимилеВОтчетах);
	
	ТабДок = ФормированиеОтчетовОСовершенныхОперациях.СформироватьПечатнуюФорму(ПараметрыПечати);
	
	Описатель = Новый Структура;
	Описатель.Вставить("ТабДок", ТабДок);
	Описатель.Вставить("Заголовок", "Приложение к РДО");
	Возврат ПоместитьВоВременноеХранилище(Описатель, УникальныйИдентификатор);
	
КонецФункции

Функция СуществуетИсполнениеПоручения(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Поручение.Исполнение КАК ИсполнениеПоручения
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Ссылка = &Поручение
	|	И Поручение.Исполнение <> ЗНАЧЕНИЕ(Документ.ИсполнениеПоручения.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Поручение", ДокументОснование);
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция ДокументОснованиеИсполнения(ДокументОперации, ЭтоВстречноеИсполнение)
	
	ТипОснования = ТипЗнч(ДокументОперации);
	Если ТипОснования = Тип("ДокументСсылка.Поручение") Или ТипОснования = Тип("ДокументОбъект.Поручение") Тогда
		ДокументОснование = ДокументОперации.Ссылка;
	Иначе
		Если ЭтоВстречноеИсполнение Тогда
			ДокументОснование = ДокументОперации.ДокументОснованиеВстречный;
		Иначе
			ДокументОснование = ДокументОперации.ДокументОснование;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокументОснование;
	
КонецФункции

#КонецОбласти
